{
  "model_type": "foo",
  "architectures": [
    "FooForCausalLM"
  ],
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "hidden_size": 4096,
  "quantization": {
    "group_size": 64,
    "bits": 4
  }
}
