{
  "model_type": "mistral3",
  "architectures": [
    "Mistral3ForConditionalGeneration"
  ],
  "text_config": {
    "num_hidden_layers": 40,
    "num_key_value_heads": 8,
    "head_dim": 128,
    "hidden_size": 5120
  },
  "quantization": {
    "group_size": 64,
    "bits": 4
  }
}
