{
  "model_type": "qwen3",
  "architectures": [
    "Qwen3ForCausalLM"
  ],
  "num_hidden_layers": 36,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "hidden_size": 2560,
  "quantization": {
    "group_size": 64,
    "bits": 4
  }
}
